'''Створіть абстрактний базовий клас "ПлатіжнийЗасіб" з методом "здійснити_платіж()". Створіть підкласи "КредитнаКарта",
"БанківськийПереказ", "ЕлектроннийГаманець" і т.д., які успадковують цей метод та реалізовують його відповідно до
специфіки кожного платіжного засобу. Створіть клас "ПлатіжнийПроцесор", який містить список доступних платіжних засобів
та метод для виконання платежу через вибраний засіб. Можна створити об'єкти різних платіжних засобів, додати їх до
платіжного процесора і здійснити платежі через них'''